In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
"""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""



df['FlightNumber']=[10045+(i*10)  for i in range(0,5) ]

df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [5]:
df.From_To.str.split('_')

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: From_To, dtype: object

In [6]:
"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame."""

Temp=pd.DataFrame()
Temp
Temp[['place1','place2']]=df.From_To.str.split('_',expand = True)

Temp

     place1     place2
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [7]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)"""

df['From_To'].str.capitalize()

0        London_paris
1        Madrid_milan
2    London_stockholm
3      Budapest_paris
4     Brussels_london
Name: From_To, dtype: object

In [10]:
"""4.  the From_To column from df and attach the temporary DataFrame
from the previous questions."""

pd.concat([df,Temp],axis=1)

,From_To,FlightNumber,RecentDelays,Airline,place1,place2
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [14]:
""" 5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN."""

Temp1=pd.DataFrame()

Temp2=pd.DataFrame(df.RecentDelays.values.tolist(), index= df.index)

Temp2
Temp3=pd.concat([df,Temp2],axis=1)
Temp3

,From_To,FlightNumber,RecentDelays,Airline,0,1,2
0,LoNDon_paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,MAdrid_miLAN,10055,[],<Air France> (12),NaN,NaN,NaN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest_PaRis,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

In [18]:
"""6. Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

pd.concat([df,Temp2],axis=1)"""
Temp3.drop('RecentDelays',inplace=True,axis=1)


Temp3

            From_To  FlightNumber              Airline     0     1     2
0      LoNDon_paris         10045               KLM(!)  23.0  47.0   NaN
1      MAdrid_miLAN         10055    <Air France> (12)   NaN   NaN   NaN
2  londON_StockhOlm         10065  (British Airways. )  24.0  43.0  87.0
3    Budapest_PaRis         10075       12. Air France  13.0   NaN   NaN
4   Brussels_londOn         10085          "Swiss Air"  67.0  32.0   NaN

In [19]:
Temp3.columns = ['From_To','FlightNumber', 'Airline', 'RecentDelays_1', 'RecentDelays_2', 'RecentDelays_3']
Temp3.columns

Index(['From_To', 'FlightNumber', 'Airline', 'RecentDelays_1',
       'RecentDelays_2', 'RecentDelays_3'],
      dtype='object')

In [20]:
df.RecentDelays.str.len().max()

3

In [21]:
['delay_' + str(i) for i in range(df.RecentDelays.str.len().max())]

['delay_0', 'delay_1', 'delay_2']